/***************************************************************

RGB(red, green, blue);

颜色RGB表示法
* red: 红色的值，从0~255，数值越大，红色值越高
* green: 绿色的值，从0~255，数值越大，绿色值越高
* blue: 蓝色的值，从0~255，数值越大，蓝色值越高

***************************************************************/
canvas.resize(400, 200);
background(RGB(100, 100, 255));

circle(200, 200, 200, RGB(255, 0, 0));
circle(200, 200, 190, RGB(255, 125, 0));
circle(200, 200, 180, RGB(255, 255, 0));
circle(200, 200, 170, RGB(125, 255, 0));
circle(200, 200, 160, RGB(0, 255, 125));
circle(200, 200, 150, RGB(0, 125, 255));
circle(200, 200, 140, RGB(125, 0, 255));
circle(200, 200, 130, RGB(100, 100, 255));