/***************************************************************
 * 
 * circle(x, y, radius, *color)
 * 
 * 在画布上画出一个圆
 * 
 * x,y      - 圆心位置
 * radius   - 圆的半径
 * color    - 圆颜色，可选参数，默认为 "orange"
 * 
 ***************************************************************/
 
canvas.showAxis();

circle(100, 100, 30);

circle(200, 100, 40, 'green');

circle(300, 100, 50, 'red');


/***************************************************************
 * 
 * 如果想要画圆框，在使用circle之前，使用fill方法
 * 
 **************************************************************/

fill(false);

circle(100, 200, 50);

circle(200, 200, 40, 'green');

circle(300, 200, 30, 'red');