/******************************************************

String
字符串连接

模板字符串
要把多个字符串连接起来，可以用+号连接

/******************************************************/

var name = '小明';
var age = 20;
var message = '你好, ' + name + ', 你今年' + age + '岁了!';

console.log(message);

/******************************************************
如果有很多变量需要连接，用+号就比较麻烦。ES6新增了一种模板字符串，表示方法和上面的多行字符串一样，但是它会自动替换字符串中的变量：
******************************************************/


var message = `你好, ${name}, 你今年${age}岁了!`;
console.log(message);